# Задание 1
# Пользователь вводит с клавиатуры три числа. В за-
# висимости от выбора пользователя программа выводит
# на экран сумму трёх чисел или произведение трёх чисел.

# answer_1 = float(input("Введите первое число: "))
# answer_2 = float(input("Введите второе число: "))
# answer_3 = float(input("Введите третье число: "))
# answer_4 = input("Введите одно из знаков '+', '*': ")
# if answer_4 == "+":
#   print(answer_1 + answer_2 + answer_3)
# elif answer_4 == "*":
#   print(answer_1 * answer_2 * answer_3)
# else:
#   print("Неверный знак")



