# Задание 1
# Пользователь вводит с клавиатуры три числа. В за-
# висимости от выбора пользователя программа выводит
# на экран сумму трёх чисел или произведение трёх чисел.

# answer_1 = float(input("Введите первое число: "))
# answer_2 = float(input("Введите второе число: "))
# answer_3 = float(input("Введите третье число: "))
# answer_4 = input("Введите одно из знаков '+', '*': ")
# if answer_4 == "+":
#   print(answer_1 + answer_2 + answer_3)
# elif answer_4 == "*":
#   print(answer_1 * answer_2 * answer_3)
# else:
#   print("Неверный знак")



# Задание 2
# Пользователь вводит с клавиатуры три числа. В за-
# висимости от выбора пользователя программа выводит
# на экран максимум из трёх, минимум из трёх или сред-
# неарифметическое трёх чисел.

answer_1 = float(input("Введите первое число: "))
answer_2 = float(input("Введите второе число: "))
answer_3 = float(input("Введите третье число: "))



# Задание 3
# Пользователь вводит с клавиатуры количество ме-
# тров. В зависимости от выбора пользователя программа
# переводит метры в мили, дюймы или ярды.

# answer = float(input("Введите количетсво метров:\n"))
# answer_2 = input("Введите во что хотите перевести метры:\n1) мили\n2) дюйм\n3) ярды\n")
# if answer_2 == "1":
#     print(answer * 0.000621371, "миль")
# elif answer_2 == "2":
#     print(answer * 39.3701, "дюйм")
# elif answer_2 == "3":
#     print(answer * 1.09361, "ярд" )
# else:
#     print("Неверный ввод")